In [ ]:
# HEROS OF PYMOLI DATA ANALYSIS 
#1.) Though male identifying humans dominate this gaming scene (83% of players), females that do play spend an average of 40 cents more per person that the male demographic. 
#2.) Other/ Non-Disclosed gendered groups spend 49 cents on average more than the male identifying demographic. 
#3.) The age group 35-39 have the highest average of total perchase per person ($4.76 per person on average).

In [1]:
# Dependencies and Setup 
import pandas as pd 
import numpy as np 


#Load csv file
pydata = "Resources/purchase_data.csv"

#Read Purchasing file and store into Pandas data frame
purchase_data = pd.read_csv(pydata)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [48]:
purchase_data.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [2]:
#Player Count

In [3]:
#establish the number of unique players 
player_count = len(purchase_data['SN'].unique())
player_count

576

In [4]:
# Display the total number of players in a DataFrame

player_table = pd.DataFrame({"Total Players": [player_count]})
player_table

   Total Players
0            576

In [5]:
#Purchasing Analysis (Total)

In [6]:
#establish the number of unique items 
unique_items = len(purchase_data['Item ID'].unique())
unique_items

183

In [7]:
#establish the average price of the items purchased
AveragePrice = purchase_data['Price'].mean()
AveragePrice

3.050987179487176

In [8]:
#establish the number of purchases 
purchase_count = len(purchase_data["Item Name"])
purchase_count

780

In [9]:
#establish the total revenue of the items purchased 
total_revenue = purchase_data['Price'].sum()
total_revenue

2379.77

In [10]:
# Place all of the data found into a summary DataFrame
purchase_table = pd.DataFrame({"Number of Unique Items": unique_items,
                              "Average Price": [AveragePrice],
                              "Number of Purchases": [purchase_count],
                              "Total Revenue": [total_revenue]})
purchase_table

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183       3.050987                  780        2379.77

In [11]:
#Gender Demographics

In [12]:
#Establish which genders are represented in this data set 
purchase_data['Gender'].unique()

array(['Male', 'Other / Non-Disclosed', 'Female'], dtype=object)

In [13]:
#Get the count for genders represented 
gender_count = purchase_data['Gender'].value_counts()
gender_count

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [14]:
#There are significantly more occurances of genders that what the HW example gives us, so we know something fishy is going on
#It turns out we have some recurring customers but we want the unique customers to be represented 
#So we want to make sure that frequent customers are not counted towards thier identifying gender more than once 
#we will use .groupby and .nunique to acheive this
gender_count= purchase_data.groupby('Gender')[['SN']].nunique()
gender_count

                        SN
Gender
Female                  81
Male                   484
Other / Non-Disclosed   11

In [15]:
#Now we also want to include the percentage for each gender (gender/total genders*100)
gender_percent = 100* gender_count['SN']/gender_count['SN'].sum()
gender_percent

Gender
Female                   14.062500
Male                     84.027778
Other / Non-Disclosed     1.909722
Name: SN, dtype: float64

In [16]:
#Create a DataFrame to display the gathered information
GenderDemo_df=pd.DataFrame([
    {'Gender':'Male', 'Total Count':484, 'Percentage of Players':84.03},
    {'Gender':'Female', 'Total Count':81, 'Percentage of Players':14.06},
    {'Gender':'Other/Non-Disclosed', 'Total Count':11, 'Percentage of Players':1.91}
])
GenderDemo_df

                Gender  Percentage of Players  Total Count
0                 Male                  84.03          484
1               Female                  14.06           81
2  Other/Non-Disclosed                   1.91           11

In [17]:
#Purchasing Analysis (Gender)

In [18]:
 # Looking only at Female purchases 
fem_df = purchase_data.loc[purchase_data["Gender"] == "Female", :]
fem_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79

In [19]:
fem_df.describe()

       Purchase ID         Age     Item ID       Price
count   113.000000  113.000000  113.000000  113.000000
mean    379.380531   21.345133   85.477876    3.203009
std     211.605484    6.097086   53.264183    1.158194
min      15.000000    7.000000    1.000000    1.000000
25%     199.000000   18.000000   39.000000    2.280000
50%     392.000000   21.000000   82.000000    3.450000
75%     558.000000   24.000000  129.000000    4.230000
max     775.000000   40.000000  183.000000    4.900000

In [20]:
#obtain total purchase value 
fem_df['Price'].sum()

361.94

In [21]:
#Average per female identifying person 
361.94/81

4.468395061728395

In [22]:
 # Looking only at Male purchases 
male_df = purchase_data.loc[purchase_data["Gender"] == "Male", :]
male_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [23]:
male_df.describe()

       Purchase ID         Age     Item ID       Price
count   652.000000  652.000000  652.000000  652.000000
mean    392.516871   22.917178   93.524540    3.017853
std     227.516414    6.689232   52.590856    1.175625
min       0.000000    7.000000    0.000000    1.000000
25%     193.750000   20.000000   52.000000    1.962500
50%     390.500000   22.000000   95.500000    3.090000
75%     592.250000   25.000000  141.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [24]:
#obtain total purchase value 
male_df['Price'].sum()

1967.64

In [25]:
#Average per male identifying person 
1967.64/484

4.065371900826446

In [26]:
 # Looking only at Other/non-disclosed purchases 
ND_df = purchase_data.loc[purchase_data["Gender"] == "Other / Non-Disclosed", :]
ND_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39

In [27]:
#obtain total purchase value 
ND_df['Price'].sum()

50.19

In [28]:
#Average per ND person 
50.19/11

4.5627272727272725

In [29]:
GenderPurchase_df = pd.DataFrame({
    "Gender": ["Male", "Female", "Other/Non-Disclosed"],
    "Purchase Count": [652, 113, 15],
    "Average Purchase Price": ['$3.02', '$3.20','$3.35'],
    "Total Purchase Value": ['$1,967.64', '$361.94','$50.19'],
    "Average Total Purchase per Person":['$4.07','$4.47','$4.56']
})
GenderPurchase_df

,Gender,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase per Person
0,Male,652,$3.02,"$1,967.64",$4.07
1,Female,113,$3.20,$361.94,$4.47
2,Other/Non-Disclosed,15,$3.35,$50.19,$4.56

In [30]:
#Age Demographics

In [31]:
#Create Bins for ages (we're binning at life, we're binning)
bins = [0,9,14,19,24,29,34,39,50]
group_names = ['<10','10-14','15-19','20-24','25-29','30-34','35-39','40+']

# Create age groups designation and append to DataFrame
purchase_data['Age Group'] = pd.cut(purchase_data.Age, bins, labels=group_names)

# Create groupby with age groups 
age_count = purchase_data.groupby('Age Group')[['SN']].nunique().reset_index()

# Glean the percentage data 
age_count['Percentage of Players'] = 100 * age_count['SN'] / age_count['SN'].sum()

# Format and display the collected data 
age_count = age_count.rename(columns={'SN':'Player Count'})
age_count['Percentage of Players'] = age_count['Percentage of Players'].map('{:.2f}'.format)
age_count.style.hide_index()

In [32]:
#Purchasing Analysis (Age)

In [33]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [34]:
# Count transactions by age and start a new DataFrame
purchaseAge = purchase_data.groupby('Age Group').agg({'Purchase ID':'count','Price':['mean','sum']}).reset_index()

# Rename the columns to match the example given
purchaseAge.columns = ['','Purchase Count','Average Purchase Price','Total Purchase Value']

# Calculate the average spent per player
purchaseAge['Average Total Purchase per Person'] = purchaseAge['Total Purchase Value'] / age_count['Player Count']

# Format and display
purchaseAge['Average Purchase Price'] =purchaseAge['Average Purchase Price'].map('${:,.2f}'.format)
purchaseAge['Total Purchase Value'] = purchaseAge['Total Purchase Value'].map('${:,.2f}'.format)
purchaseAge['Average Total Purchase per Person'] = purchaseAge['Average Total Purchase per Person'].map('${:,.2f}'.format)
purchaseAge.style.hide_index()

In [35]:
#Top Spenders

In [36]:
# Generate the groupby DataFrame
topSpenders= purchase_data.groupby('SN').agg({'Purchase ID':'count','Price':['mean','sum']}).reset_index()

In [37]:
# Sort and organize  
topSpenders= topSpenders.sort_values([('Price','sum')],ascending=False).head(5)
topSpenders

              SN Purchase ID     Price
                       count      mean    sum
360    Lisosia93           5  3.792000  18.96
246  Idastidru52           4  3.862500  15.45
106   Chamjask73           3  4.610000  13.83
275       Iral74           4  3.405000  13.62
281  Iskadarya95           3  4.366667  13.10

In [38]:
# Rename the columns to match the example given
topSpenders.columns = ['SN','Purchase Count','Average Purchase Price','Total Purchase Value']
topSpenders.style.hide_index()

In [39]:
#Most Popular Items

In [40]:
# Generate the groupby DataFrame
Pop_Items = purchase_data.groupby('Item ID').agg({'Item Name':'first','Purchase ID':'count','Price':['mean','sum']})

In [41]:
# Sort and organize  
Pop_Items = Pop_Items.sort_values([('Purchase ID', 'count')],ascending=False).head(5)

In [42]:
# Rename the columns to match the example given
Pop_Items.columns = ['Item Name','Purchase Count','Average Purchase Price','Total Purchase Value']
Pop_Items

,Item Name,Purchase Count,Average Purchase Price,Total Purchase Value
Item ID,,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

In [43]:
#Most Profitable Items

In [44]:
Prof_Items = purchase_data.groupby('Item ID').agg({'Item Name':'first','Purchase ID':'count','Price':['mean','sum']}).reset_index()

In [45]:
Prof_Items = Prof_Items.sort_values([('Price','sum')],ascending=False).head(5)

In [46]:
# Rename the columns to match the example given
Prof_Items.columns = ['Item ID','Item Name','Purchase Count','Average Purchase Price','Total Purchase Value']
Prof_Items.style.hide_index()